{"format": "graph-model", "generatedBy": "2.14.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "40"}, {"size": "61"}]}}}, "outputs": {"output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/onnx_tf_prefix_/Constant_4", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/Where", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{}, {"size": "1"}]}}}}}, {"name": "PartitionedCall/Cast_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/zeros_like_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/zeros_like_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/ExpandDims", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/Cast_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/Const_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/split", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "16"}, {"size": "1"}, {"size": "48"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "PartitionedCall/transpose_2/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/transpose_3/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_4/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder1/encoder1.3/BatchNormalization/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "48"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder1/encoder1.3/BatchNormalization/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "48"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Const_4", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "PartitionedCall/transpose_6/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/split_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "48"}, {"size": "64"}]}}}}}, {"name": "unknown_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "PartitionedCall/transpose_7/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/transpose_8/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/transpose_9/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder2/encoder2.3/BatchNormalization/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder2/encoder2.3/BatchNormalization/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{}]}}}}}, {"name": "PartitionedCall/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/flatten/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/flatten/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/flatten/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/flatten/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/transpose_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "128"}]}}}}}, {"name": "PartitionedCall/mul_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "PartitionedCall/transpose_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "40"}, {"size": "61"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/SparseToDense_2", "op": "SparseToDense", "input": ["PartitionedCall/ExpandDims", "PartitionedCall/Cast_1", "PartitionedCall/onnx_tf_prefix_/Constant_3", "PartitionedCall/Const_2"], "attr": {"validate_indices": {"b": true}, "Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/Shape", "op": "Shape", "input": ["input"], "attr": {"out_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/GatherNd", "op": "GatherNd", "input": ["PartitionedCall/Shape", "PartitionedCall/ExpandDims"], "attr": {"Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/Minimum", "op": "Minimum", "input": ["PartitionedCall/onnx_tf_prefix_/Constant_1", "PartitionedCall/GatherNd"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/Minimum_1", "op": "Minimum", "input": ["PartitionedCall/onnx_tf_prefix_/Constant_2", "PartitionedCall/GatherNd"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/Less_1", "op": "Less", "input": ["PartitionedCall/Minimum", "PartitionedCall/zeros_like_1"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/add_1", "op": "AddV2", "input": ["PartitionedCall/Minimum", "PartitionedCall/GatherNd"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/Less_2", "op": "Less", "input": ["PartitionedCall/Minimum_1", "PartitionedCall/zeros_like_2"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/add_2", "op": "AddV2", "input": ["PartitionedCall/Minimum_1", "PartitionedCall/GatherNd"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/SelectV2_1", "op": "SelectV2", "input": ["PartitionedCall/Less_1", "PartitionedCall/add_1", "PartitionedCall/Minimum"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/SelectV2_2", "op": "SelectV2", "input": ["PartitionedCall/Less_2", "PartitionedCall/add_2", "PartitionedCall/Minimum_1"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/SparseToDense", "op": "SparseToDense", "input": ["PartitionedCall/ExpandDims", "PartitionedCall/Cast_1", "PartitionedCall/SelectV2_1", "PartitionedCall/zeros"], "attr": {"T": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "PartitionedCall/SparseToDense_1", "op": "SparseToDense", "input": ["PartitionedCall/ExpandDims", "PartitionedCall/Cast_1", "PartitionedCall/SelectV2_2", "PartitionedCall/Const"], "attr": {"T": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "PartitionedCall/Equal", "op": "Equal", "input": ["PartitionedCall/SparseToDense_1", "PartitionedCall/Const_1"], "attr": {"T": {"type": "DT_INT64"}, "incompatible_shape_error": {"b": true}}}, {"name": "PartitionedCall/SelectV2_3", "op": "SelectV2", "input": ["PartitionedCall/Equal", "PartitionedCall/Shape", "PartitionedCall/SparseToDense_1"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Slice", "op": "StridedSlice", "input": ["input", "PartitionedCall/SparseToDense", "PartitionedCall/SelectV2_3", "PartitionedCall/SparseToDense_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Transpose", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_/Slice", "PartitionedCall/onnx_tf_prefix_/Transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Pad", "op": "Pad", "input": ["PartitionedCall/onnx_tf_prefix_/Transpose", "PartitionedCall/Const_3"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose_1", "op": "Transpose", "input": ["PartitionedCall/Pad", "PartitionedCall/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/convolution", "op": "Conv2D", "input": ["PartitionedCall/transpose_1", "PartitionedCall/split"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "PartitionedCall/Add_3", "op": "AddV2", "input": ["PartitionedCall/convolution", "unknown_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_2", "op": "Transpose", "input": ["PartitionedCall/Add_3", "PartitionedCall/transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder1/encoder1.1/Relu", "op": "Relu", "input": ["PartitionedCall/transpose_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_3", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_/encoder1/encoder1.1/Relu", "PartitionedCall/transpose_3/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MaxPool2d", "op": "MaxPool", "input": ["PartitionedCall/transpose_3"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "PartitionedCall/transpose_4", "op": "Transpose", "input": ["PartitionedCall/MaxPool2d", "PartitionedCall/transpose_4/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder1/encoder1.3/BatchNormalization/mul_1", "op": "Mul", "input": ["PartitionedCall/transpose_4", "PartitionedCall/onnx_tf_prefix_/encoder1/encoder1.3/BatchNormalization/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder1/encoder1.3/BatchNormalization/add_1", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_/encoder1/encoder1.3/BatchNormalization/mul_1", "PartitionedCall/onnx_tf_prefix_/encoder1/encoder1.3/BatchNormalization/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Pad_1", "op": "Pad", "input": ["PartitionedCall/onnx_tf_prefix_/encoder1/encoder1.3/BatchNormalization/add_1", "PartitionedCall/Const_4"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_6", "op": "Transpose", "input": ["PartitionedCall/Pad_1", "PartitionedCall/transpose_6/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/convolution_1", "op": "Conv2D", "input": ["PartitionedCall/transpose_6", "PartitionedCall/split_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "1", "1"]}}}}, {"name": "PartitionedCall/Add_4", "op": "AddV2", "input": ["PartitionedCall/convolution_1", "unknown_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_7", "op": "Transpose", "input": ["PartitionedCall/Add_4", "PartitionedCall/transpose_7/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder2/encoder2.1/Relu", "op": "Relu", "input": ["PartitionedCall/transpose_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_8", "op": "Transpose", "input": ["PartitionedCall/onnx_tf_prefix_/encoder2/encoder2.1/Relu", "PartitionedCall/transpose_8/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/MaxPool2d_1", "op": "MaxPool", "input": ["PartitionedCall/transpose_8"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "PartitionedCall/transpose_9", "op": "Transpose", "input": ["PartitionedCall/MaxPool2d_1", "PartitionedCall/transpose_9/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder2/encoder2.3/BatchNormalization/mul_1", "op": "Mul", "input": ["PartitionedCall/transpose_9", "PartitionedCall/onnx_tf_prefix_/encoder2/encoder2.3/BatchNormalization/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder2/encoder2.3/BatchNormalization/add_1", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_/encoder2/encoder2.3/BatchNormalization/mul_1", "PartitionedCall/onnx_tf_prefix_/encoder2/encoder2.3/BatchNormalization/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Shape_5", "op": "Shape", "input": ["PartitionedCall/onnx_tf_prefix_/encoder2/encoder2.3/BatchNormalization/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/GatherV2", "op": "GatherV2", "input": ["PartitionedCall/Shape_5", "PartitionedCall/Squeeze", "PartitionedCall/GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "PartitionedCall/SparseToDense_3", "op": "SparseToDense", "input": ["PartitionedCall/Where", "PartitionedCall/Cast_2", "PartitionedCall/GatherV2", "PartitionedCall/zeros_1"], "attr": {"Tindices": {"type": "DT_INT64"}, "validate_indices": {"b": true}, "T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/add_5", "op": "AddV2", "input": ["PartitionedCall/onnx_tf_prefix_/Constant_4", "PartitionedCall/SparseToDense_3"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/Reshape", "op": "Reshape", "input": ["PartitionedCall/onnx_tf_prefix_/encoder2/encoder2.3/BatchNormalization/add_1", "PartitionedCall/add_5"], "attr": {"Tshape": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/flatten/Shape", "op": "Shape", "input": ["PartitionedCall/onnx_tf_prefix_/Reshape"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/flatten/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/flatten/Shape", "PartitionedCall/flatten/strided_slice/stack", "PartitionedCall/flatten/strided_slice/stack_1", "PartitionedCall/flatten/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/flatten/Reshape/shape", "op": "Pack", "input": ["PartitionedCall/flatten/strided_slice", "PartitionedCall/flatten/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "PartitionedCall/flatten/Reshape", "op": "Reshape", "input": ["PartitionedCall/onnx_tf_prefix_/Reshape", "PartitionedCall/flatten/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MatMul", "op": "MatMul", "input": ["PartitionedCall/flatten/Reshape", "PartitionedCall/transpose_10"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add_6", "op": "AddV2", "input": ["PartitionedCall/MatMul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_/output/output.1/Relu", "op": "Relu", "input": ["PartitionedCall/add_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MatMul_1", "op": "MatMul", "input": ["PartitionedCall/onnx_tf_prefix_/output/output.1/Relu", "PartitionedCall/transpose_11"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "PartitionedCall/add_7", "op": "AddV2", "input": ["PartitionedCall/MatMul_1", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/add_7"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/onnx_tf_prefix_/Constant_4", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/Where", "shape": [0, 1], "dtype": "int32"}, {"name": "PartitionedCall/Cast_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/zeros_like_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/zeros", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/Const_1", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/zeros_like_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/Const", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/ExpandDims", "shape": [1, 1], "dtype": "int32"}, {"name": "PartitionedCall/Cast_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_/Constant_3", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/Const_2", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_/Transpose/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/Const_3", "shape": [4, 2], "dtype": "int32"}, {"name": "PartitionedCall/transpose_1/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split", "shape": [8, 16, 1, 48], "dtype": "float32"}, {"name": "unknown_0", "shape": [48], "dtype": "float32"}, {"name": "PartitionedCall/transpose_2/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/transpose_3/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/transpose_4/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder1/encoder1.3/BatchNormalization/mul", "shape": [1, 48, 1, 1], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder1/encoder1.3/BatchNormalization/sub", "shape": [1, 48, 1, 1], "dtype": "float32"}, {"name": "PartitionedCall/Const_4", "shape": [4, 2], "dtype": "int32"}, {"name": "PartitionedCall/transpose_6/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/split_1", "shape": [5, 5, 48, 64], "dtype": "float32"}, {"name": "unknown_6", "shape": [64], "dtype": "float32"}, {"name": "PartitionedCall/transpose_7/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/transpose_8/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/transpose_9/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder2/encoder2.3/BatchNormalization/mul", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_/encoder2/encoder2.3/BatchNormalization/sub", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "PartitionedCall/Squeeze", "shape": [0], "dtype": "int32"}, {"name": "PartitionedCall/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/zeros_1", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/flatten/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/flatten/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/flatten/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/flatten/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/transpose_10", "shape": [768, 128], "dtype": "float32"}, {"name": "PartitionedCall/mul_1", "shape": [128], "dtype": "float32"}, {"name": "PartitionedCall/transpose_11", "shape": [128, 4], "dtype": "float32"}, {"name": "PartitionedCall/mul_3", "shape": [4], "dtype": "float32"}]}]}